benchmark_results_container/fileio_bench_rndwr_container.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 56MiB each
7GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     562.16
    fsyncs/s:                     719.79

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.78

General statistics:
    total time:                          300.0896s
    total number of events:              384576

Latency (ms):
         min:                                    0.00
         avg:                                    0.78
         max:                                   22.38
         95th percentile:                        2.52
         sum:                               299654.35

Threads fairness:
    events (avg/stddev):           384576.0000/0.00
    execution time (avg/stddev):   299.6544/0.00