benchmark_results_container/fileio_bench_seqwr_container.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 56MiB each
7GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     8385.32
    fsyncs/s:                     10733.42

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               131.02

General statistics:
    total time:                          300.0103s
    total number of events:              5735730

Latency (ms):
         min:                                    0.01
         avg:                                    0.05
         max:                                   98.87
         95th percentile:                        0.03
         sum:                               298245.06

Threads fairness:
    events (avg/stddev):           5735730.0000/0.00
    execution time (avg/stddev):   298.2451/0.00